[
  {
    "id": "DOCASSIST-7",
    "title": "Make PAN entry mandatory for all payment greater than 2 Lakh",
    "description": "Government has made a rule for all ecommerce company to collect PAN card for bill amount greater than 2 Lakhs.Add it in payment section",
    "status": "processed",
    "ai": {
      "classification": "Enhancement",
      "behavior_change": "PAN entry is now mandatory for payments greater than 2 Lakhs.",
      "keywords": [
        "PAN",
        "payment",
        "mandatory"
      ],
      "impact": {
        "service": "payment",
        "impact_location": "payment_section",
        "is_permanent": "permanent"
      }
    }
  },
  {
    "id": "DOCASSIST-6",
    "title": "Issue in inventory check logic",
    "description": "Reference order:#123456#789012There was 2 inventory available for SKU: ABC Partner created the cart with 2 units and successfully placed order.Order created and  2 units being soft allocated now net available inventory is 0 for SKU:ABCThink if partner not able to proceed payment due to payment page error. Now net available inventory becomes zero. so when partner again tries to place order partner cant since the inventory has become zero. Solution: Check inventory during order creation (to soft allocate) but do not check inventory at payment page during the time of partner payment",
    "status": "processed",
    "ai": {
      "classification": "Bug",
      "behavior_change": "Inventory check logic during order creation and payment processing has changed. Previously, inventory was checked at both order creation and payment stages, leading to issues when payment fails. Now, inventory is only checked during order creation to avoid blocking future orders due to failed payments.",
      "keywords": [
        "inventory",
        "order creation",
        "payment processing"
      ],
      "impact_details": {
        "service": "fulfillment",
        "impact_location": "inventory management during order and payment processing",
        "is_permanent": "permanent"
      }
    }
  },
  {
    "id": "DOCASSIST-5",
    "title": "Pre-reserve notification email template chnage",
    "description": "Due to new campaign we wish to make a small change in pre reserve email notification template.It has 2 new variable voucher code and price. Pls find the attached template",
    "status": "processed",
    "ai": {
      "classification": "Enhancement",
      "behavior_change": "Pre-reserve notification email template has been updated to include two new variables: voucher code and price.",
      "keywords": [
        "pre-reserve",
        "email",
        "template",
        "voucher",
        "price"
      ],
      "impact_details": {
        "service": "fulfillment",
        "impact_location": "email_notification",
        "is_permanent": "permanent"
      }
    }
  },
  {
    "id": "DOCASSIST-4",
    "title": "Profile badge icon is  missing",
    "description": "Steps to recreate bugs1) login to app2) hover profile icon3) profile colour and icon is missing",
    "status": "processed",
    "ai": {
      "classification": "Bug",
      "behavior_change": "Profile badge icon and color are missing when hovering over the profile icon in the app.",
      "keywords": [
        "profile",
        "badge",
        "icon",
        "hover"
      ],
      "impact_details": {
        "service": "catalog",
        "impact_location": "user profile section",
        "is_permanent": "temporary"
      }
    }
  },
  {
    "id": "DOCASSIST-3",
    "title": "Ecommerce Purchase Journey",
    "description": "Ecommerce purchase journey from homepage ro order thank you page",
    "status": "processed",
    "ai": {
      "classification": "Enhancement",
      "behavior_change": "The e-commerce purchase journey from the homepage to the order thank you page has been updated.",
      "keywords": [
        "purchase journey",
        "homepage",
        "order thank you page"
      ],
      "impact_details": {
        "service": "orders",
        "impact_location": "end-to-end purchase flow",
        "is_permanent": "permanent"
      }
    }
  },
  {
    "id": "DOCASSIST-2",
    "title": "colour change for buy online pick in store orders",
    "description": "Add one more logic for BOPIS (buy online pick up in store) colour change. Apply all usual colour validation. On top of it only for BOPIS orders Check for inventory at the physical store not online inventory, if the physical store inventory is not available then colour change should not be allowed.",
    "status": "processed",
    "ai": {
      "classification": "Enhancement",
      "behavior_change": "Added logic to change the colour of BOPIS (Buy Online Pick Up In Store) orders based on physical store inventory availability. The colour change is only applied if the physical store has sufficient inventory.",
      "keywords": [
        "BOPIS",
        "colour change",
        "physical store inventory"
      ],
      "impact": {
        "service": "fulfillment",
        "impact_location": "BOPIS order processing",
        "is_permanent": "permanent"
      }
    }
  },
  {
    "id": "DOCASSIST-1",
    "title": "Address section pincode should match with GST pincode",
    "description": "Need to add GST pincode validation in checkout page.Currently, we dont have any pincode check for delivery address section form and GST section form. We need to introduce same state pincode check for both address form section and GST form section. If same state pincode doesnt match then throw error “GST Pincode doesnt match with delivery address state’s pincode” and dont allow to proceed to payment section.",
    "status": "processed",
    "ai": {
      "classification": "Enhancement",
      "behavior_change": "Introducing GST pincode validation in the checkout page to ensure the pincode in the delivery address matches the GST pincode.",
      "keywords": [
        "GST pincode",
        "checkout page",
        "validation"
      ],
      "impact": {
        "service": "orders",
        "impact_location": "checkout page",
        "is_permanent": "permanent"
      }
    }
  }
]